In [10]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%sql sqlite:///students.db

1. CREATE (Insert Data)
It is used to add new record into table.

In [7]:
%%sql
CREATE TABLE if not exists students(
    id INT NOT NULL,
    people_name VARCHAR(20),
    birth_date DATE NOT NULL,
    phone VARCHAR(15),
    PRIMARY KEY (id)
);

 * sqlite:///students.db
Done.

[]

2.INSERT 
Used to insert Data into table.

In [16]:
%%sql
INSERT INTO students (id, people_name, birth_date, phone)
VALUES
(1, 'Ram', '1985-08-23', '9123456780'),
(2, 'leo', '1992-11-10', '9988776655'),
(3, 'Brown', '1998-03-17', '9090909090'),
(4, 'john', '1980-12-01', '9008007006');

 * sqlite:///students.db
(sqlite3.IntegrityError) UNIQUE constraint failed: students.id
[SQL: INSERT INTO students (id, people_name, birth_date, phone)
VALUES
(1, 'Ram', '1985-08-23', '9123456780'),
(2, 'leo', '1992-11-10', '9988776655'),
(3, 'Brown', '1998-03-17', '9090909090'),
(4, 'john', '1980-12-01', '9008007006');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

3.READ
It is used to fetch  from the table.

In [18]:
%%sql 
select * from students;

 * sqlite:///students.db
Done.

[(1, 'Ram', '1985-08-23', '9123456780'),
 (2, 'leo', '1992-11-10', '9988776655'),
 (3, 'Brown', '1998-03-17', '9090909090'),
 (4, 'john', '1980-12-01', '9008007006')]

In [21]:
%%sql
select * from students where people_name='leo';;

 * sqlite:///students.db
Done.
Done.

[]

4.UPDATE or Modify Data
It is used to modify or update the data into table

In [7]:
%%sql
update students
set people_name = 'Hari'
where id = 4;

 * sqlite:///students.db
1 rows affected.

[]

In [11]:
%%sql
select * from students where birth_date > '1990-01-01';

 * sqlite:///students.db
Done.

[(2, 'leo', '1992-11-10', '9988776655'),
 (3, 'Brown', '1998-03-17', '9090909090')]

In [12]:
%%sql
select * from students where birth_date > '1985-08-23';

 * sqlite:///students.db
Done.

[(2, 'leo', '1992-11-10', '9988776655'),
 (3, 'Brown', '1998-03-17', '9090909090')]